frontend/models/SignupForm.php

    public function signup()
    {
        if ($this->validate()) {
        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->save(false);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('test2', 'test@test.test', '$2y$13$nkJjnRxrhr/yxDzcrMzEceHCW7087EoJhhfZyrvhFeM1pjcjSn.Yq', '9YBDbUTp2F_ZC0eRTAqEOCiC7PAwan5g', 1477335890, 1477335890)